#### Terraform Format and Style 🖌 ✅ No formatting issues found.
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/0ff29879-28ad-4805-bb0a-0c5a27bbcc2b/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_project.playground will be created
  + resource "digitalocean_project" "playground" {
      + created_at  = (known after apply)
      + description = "A project to represent development resources."
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = false
      + name        = "playground"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # digitalocean_project.playground will be created%0A  + resource "digitalocean_project" "playground" {%0A      + created_at  = (known after apply)%0A      + description = "A project to represent development resources."%0A      + environment = "Development"%0A      + id          = (known after apply)%0A      + is_default  = false%0A      + name        = "playground"%0A      + owner_id    = (known after apply)%0A      + owner_uuid  = (known after apply)%0A      + purpose     = "Web Application"%0A      + resources   = (known after apply)%0A      + updated_at  = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pushed by: @christopherellis, Action: `pull_request`*